## Encoding / Preprocessing	
Encode Categorical Variable (Sex Column) by converting it into numerical format as (female= 1, male= 0).
Missing values in Embarked were filled with the most common port.
The Embarked ports were encoded as numbers from 1 to 3 to make them usable for the model.

In [14]:
import pandas as pd

We first load the training and testing datasets.

In [16]:
train_df = pd.read_csv("../../Data/test.csv")
test_df = pd.read_csv("../../Data/test.csv")

train_df.head()
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Encode the Sex Column: 
Requirement: Female = 1 and Male = 0

In [17]:
sex_mapping = {'female': 1, 'male': 0}

train_df['Sex'] = train_df['Sex'].map(sex_mapping)
test_df['Sex'] = test_df['Sex'].map(sex_mapping)

In [20]:
train_df.head()
#test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

## Train set:  Embarked column has (2) missing values.
Find the Most Common Embarked Port
Requirement: Missing Embarked values must be filled with the most common port.

In [21]:
most_common_port = train_df['Embarked'].mode()[0]
print("Most common Embarked port:", most_common_port)

Most common Embarked port: S

In [22]:
train_df['Embarked'] = train_df['Embarked'].fillna(most_common_port)

Encode Embarked as Numbers (1 to 3)
Requirement:
•	S (Southampton) = 1
•	C (Cherbourg) = 2
•	Q (Queenstown) = 3

In [23]:
embarked_mapping = {
    'C': 1,
    'Q': 2,
    'S': 3
}

train_df['Embarked'] = train_df['Embarked'].map(embarked_mapping)

In [24]:
print(train_df['Embarked'].value_counts())

Embarked
3    270
1    102
2     46
Name: count, dtype: int64

In [25]:
#verifying if any missing value is still present-
print("Train missing values:\n", train_df.isnull().sum())

Train missing values:
 PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [26]:
print(train_df[['Sex', 'Embarked']].head())

   Sex  Embarked
0    0         2
1    1         3
2    0         2
3    0         3
4    1         3